import ContentPage from 'components/ContentPage';
import { track } from 'core';
import React, { FC, useEffect } from 'react';
import { Styles } from 'styles';

export const RightsScreen: FC = () => {
  useEffect(() => track('RightsScreenVisit'), []);
  return (
    <ContentPage>
      <h1>Права, обов‘язки та відповідальність депутата</h1>
      <p style={styles.center}>
        <a href="/">Повернутись до карти</a>
      </p>
      <p style={styles.center}>
        <img
          style={styles.img}
          src="https://firebasestorage.googleapis.com/v0/b/kremen-deputies.appspot.com/o/assets%2F30048ef2b02f607d29b168e1a40caa1c.jpg?alt=media&token=ff2dd894-9dc6-40e4-9449-95f6fb3333c7"
          alt="Права, обов‘язки та відповідальність депутата"
        />
      </p>
      <p>
        Статус депутата місцевої ради – це набір додаткових прав і можливостей, але також - і обов’язків, які
        відрізняють депутата, як обраного виборцями представника ограни місцевого самоврядування (ОМС), від інших
        виборців, що його обрали.
      </p>
      <p>
        Отже, виборці обирають з-поміж себе депутатів і тим самим наділяють їх додатковими правами, можливостями і
        повноваженнями задля представлення їх інтересів як в ОМС, так і у взаєминах з органами державної влади, іншими
        ОМС та організаціями і установами. А депутат, відповідно, свідомо бере на себе обов’язки по представленню
        інтересів територіальної громади, яка його обрала.
      </p>
      <p>
        Депутат має діяти у рамках законів України «Про місцеве самоврядування в Україні», «Про статус депутатів
        місцевих рад»
      </p>
      <p>
        Крім того, права, можливості і обов’язки депутата місцевої ради детально розписуються в муніципальних правових
        актах: статуті територіальної громади; регламенті ради поточного скликання.{' '}
      </p>
      <p>
        Після набуття депутатом місцевої ради повноважень на першому пленарному засідання сесії ради поточного скликання
        йому видається посвідчення з фотографією та нагрудний значок.{' '}
      </p>
      <p>Депутат місцевої ради зобов’язаний: </p>
      <ul>
        <li>
          визначити і оприлюднити дні, години та місце прийому виборців та інших громадян ( не рідше одного разу на
          місяць);{' '}
        </li>
        <li>відповідь на звернення виборця має бути надана протягом 30 днів. </li>
        <li>депутат місцевої ради зобов’язаний: брати участь у громадських слуханнях на своєму виборчому окрузі; </li>
        <li>
          організовувати виконання рішень ради та її органів, доручень виборців з питань, що стосуються його виборчого
          округу;{' '}
        </li>
        <li>брати участь у заходах, що проводяться ОМС на території громади або виборчого округу; </li>
        <li>
          виконувати доручення ради її органів, сільського, селищного, міського голови чи голови ради, інформувати їх
          про виконання доручень.{' '}
        </li>
        <li>
          депутат зобов’язаний: не рідше одного разу на півріччя інформувати виборців про роботу місцевої ради та її
          органів;{' '}
        </li>
        <li>періодично, не рідше одного разу на рік, звітувати про свою роботу перед виборцями. </li>
        <li>
          депутат зобов’язаний вивчати громадську думку і потреби територіальної громади й інформувати про них раду та
          її органи.{' '}
        </li>
        <li>
          депутат місцевої ради (крім секретаря ради, голови районної у місті, районної, обласної ради та їх
          заступників) повинен входити до складу однієї з постійних комісій, що утворюються радою. (до складу постійних
          комісій ради входять виключно депутат).{' '}
        </li>
        <li>
          депутат повинен брати участь в засіданнях сесій рад та голосування. (сесія складається із засідань постійних
          комісій ради та пленарних засідань ради).
        </li>
        <li>
          депутат місцевої ради має право ухвального голосу з усіх питань, що розглядаються на засіданнях ради та її
          органів, до складу яких він входить.
        </li>
        <li>депутат місцевої ради не може нікому передати право голосувати на засіданнях сесій рад. </li>
      </ul>
      <p>Депутат має право на:</p>
      <ul>
        <li>
          невідкладний прийом посадовими особами ОМС та органів виконавчої влади, керівниками підприємств, установ та
          організацій, розташованих на території ради.
        </li>
        <li>
          на звернення депутата місцевої ради посадові особи ОМС та органів виконавчої влади, керівники підприємств,
          установ та організацій надають йому довідкові матеріали та іншу інформацію, необхідні для здійснення
          депутатських повноважень.{' '}
        </li>
        <li>строк відповіді на депутатське звернення становить 10 днів ( в разі неможливості – 30 днів). </li>
        <li>
          Має право вимагати усунення порушення законності У разі виявлення порушення прав та законних інтересів
          громадян або інших порушень законності депутат місцевої ради має право вимагати припинення порушень та
          звернутися до відповідних місцевих органів виконавчої влади, ОМС та їх посадових осіб, а також – до
          правоохоронних і контролюючих органів та їх керівників з вимогою вжити заходів щодо припинення порушення
          законності.
        </li>
        <li>
          депутат може передати головуючому на засіданні сесії ради тексти свого невиголошеного виступу, пропозиції і
          зауваження з обговорюваного питання для включення до протоколу засідання сесії ради.{' '}
        </li>
        <li>
          депутат місцевої ради має виключне право на здійснення депутатського запиту – підтриманої засіданням сесії
          ради вимоги до посадових осіб ради та її органів, сільського, селищного і міського голови, керівників
          підприємств, установ і організацій з питань, які віднесені до відання ради.{' '}
        </li>
        <li>
          депутат місцевої ради має право порушувати в раді та її органах питання про необхідність проведення перевірок
          з питань, віднесених до компетенції відповідної ради або її органів, брати участь у перевірках виконання
          рішень ради.
        </li>
      </ul>
      <p style={styles.center}>
        <a href="/">Повернутись до карти</a>
      </p>
    </ContentPage>
  );
};

const styles: Styles = {
  center: {
    textAlign: 'center',
  },
  img: {
    width: '100%',
  },
};

export default RightsScreen;
